/*********************************************************/
/*  kpga.h                                               */
/*                                                       */
/*  ナップサック問題                                     */
/*  遺伝的アルゴリズム（GA）による求解プログラム         */
/*                                                       */
/*********************************************************/
#ifndef _KPGA_H_
#define _KPGA_H_

#include "ga.h"

#define LASTG 50   /*  打ち切り世代  */

int kpga();


#endif


